package location

func ParseProvince(name string) (string, bool) {
	province, found := MAP_AREANAME_PARSE[name]
	if found {
		return province, true
	} else {
		return name, false
	}
}

func MustParseProvince(name string) string {
	province, _ := ParseProvince(name)
	return province
}

func MustParseCity(name string) string {
	adcode := GetAdcode(name)
	if adcode != "" {
		return name
	}

	adcode = GetAdcode(name + "市")
	if adcode != "" {
		return name + "市"
	}

	return name
}

func GetCode(adcode string) string {
	code, found := MAP_ADCODE_CODE[adcode]
	if !found {
		return ""
	} else {
		return code
	}
}

func GetSimpleName(adcode string) string {
	name, found := MAP_ADCODE_NAME_SIMPLE[adcode]
	if !found {
		return ""
	} else {
		return name
	}
}

var (
	MAP_ADCODE_CODE = map[string]string{
		"340000": "AH",
		"110000": "BJ",
		"500000": "CQ",
		"350000": "FJ",
		"440000": "GD",
		"620000": "GS",
		"450000": "GX",
		"520000": "GZ",
		"410000": "HA",
		"420000": "HB",
		"130000": "HE",
		"460000": "HI",
		"810000": "HK",
		"230000": "HL",
		"430000": "HN",
		"220000": "JL",
		"320000": "JS",
		"360000": "JX",
		"210000": "LN",
		"820000": "MO",
		"150000": "NM",
		"640000": "NX",
		"630000": "QH",
		"510000": "SC",
		"370000": "SD",
		"310000": "SH",
		"610000": "SN",
		"140000": "SX",
		"120000": "TJ",
		"710000": "TW",
		"650000": "XJ",
		"540000": "XZ",
		"530000": "YN",
		"330000": "ZJ",
	}

	MAP_ADCODE_NAME_SIMPLE = map[string]string{
		"340000": "安徽",
		"110000": "北京",
		"500000": "重庆",
		"350000": "福建",
		"440000": "广东",
		"620000": "甘肃",
		"450000": "广西",
		"520000": "贵州",
		"410000": "河南",
		"420000": "湖北",
		"130000": "河北",
		"460000": "海南",
		"810000": "香港",
		"230000": "黑龙江",
		"430000": "湖南",
		"220000": "吉林",
		"320000": "江苏",
		"360000": "江西",
		"210000": "辽宁",
		"820000": "澳门",
		"150000": "内蒙古",
		"640000": "宁夏",
		"630000": "青海",
		"510000": "四川",
		"370000": "山东",
		"310000": "上海",
		"610000": "陕西",
		"140000": "山西",
		"120000": "天津",
		"710000": "台湾",
		"650000": "新疆",
		"540000": "西藏",
		"530000": "云南",
		"330000": "浙江",
	}

	MAP_AREANAME_PARSE = map[string]string{
		"广东":           "广东省",
		"江苏":           "江苏省",
		"河南":           "河南省",
		"浙江":           "浙江省",
		"山东":           "山东省",
		"河北":           "河北省",
		"福建":           "福建省",
		"北京":           "北京市",
		"安徽":           "安徽省",
		"湖北":           "湖北省",
		"四川":           "四川省",
		"山西":           "山西省",
		"上海":           "上海市",
		"江西":           "江西省",
		"辽宁":           "辽宁省",
		"湖南":           "湖南省",
		"广西":           "广西壮族自治区",
		"陕西":           "陕西省",
		"黑龙江":          "黑龙江省",
		"吉林":           "吉林省",
		"云南":           "云南省",
		"内蒙古":          "内蒙古自治区",
		"贵州":           "贵州省",
		"重庆":           "重庆市",
		"天津":           "天津市",
		"甘肃":           "甘肃省",
		"海南":           "海南省",
		"中国":           "中国",
		"新疆":           "新疆维吾尔自治区",
		"宁夏":           "宁夏回族自治区",
		"青海":           "青海省",
		"西藏":           "西藏自治区",
		"香港":           "香港特别行政区",
		"澳门":           "澳门特别行政区",
		"台湾":           "台湾省",
		"香港特別行政區":      "香港特别行政区",
		"澳門特別行政區":      "澳门特别行政区",
		"Beijing":      "北京市",
		"Guangdong":    "广东省",
		"Shanghai":     "上海市",
		"Yunnan":       "云南省",
		"Anhui":        "安徽省",
		"Jiangxi":      "江西省",
		"Guangxi":      "广西壮族自治区",
		"Xinjiang":     "新疆维吾尔自治区",
		"Shandong":     "山东省",
		"Liaoning":     "辽宁省",
		"Heilongjiang": "黑龙江省",
		"Tianjin":      "天津市",
		"Jiangsu":      "江苏省",
		"Sichuann":     "四川省",
		"Hubei":        "湖北省",

		"广东省":      "广东省",
		"江苏省":      "江苏省",
		"河南省":      "河南省",
		"浙江省":      "浙江省",
		"山东省":      "山东省",
		"河北省":      "河北省",
		"福建省":      "福建省",
		"北京市":      "北京市",
		"安徽省":      "安徽省",
		"湖北省":      "湖北省",
		"四川省":      "四川省",
		"山西省":      "山西省",
		"上海市":      "上海市",
		"江西省":      "江西省",
		"辽宁省":      "辽宁省",
		"湖南省":      "湖南省",
		"广西壮族自治区":  "广西壮族自治区",
		"陕西省":      "陕西省",
		"黑龙江省":     "黑龙江省",
		"吉林省":      "吉林省",
		"云南省":      "云南省",
		"内蒙古自治区":   "内蒙古自治区",
		"贵州省":      "贵州省",
		"重庆市":      "重庆市",
		"天津市":      "天津市",
		"甘肃省":      "甘肃省",
		"海南省":      "海南省",
		"新疆维吾尔自治区": "新疆维吾尔自治区",
		"宁夏回族自治区":  "宁夏回族自治区",
		"青海省":      "青海省",
		"西藏自治区":    "西藏自治区",
		"香港特别行政区":  "香港特别行政区",
		"澳门特别行政区":  "澳门特别行政区",
		"台湾省":      "台湾省",
	}
)
